<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"production","backend":"9cf94d7ecb6b3db681ada79b00ec98eb2f9360dafa9e5bf5794a41e17ca5629e","plan_job_ref":"Job Pull Request Checks #3226 at https://github.com/GSA-TTS/FAC/actions/runs/9678074936","plan_out_hash":"a91184df574f33ce077f57f1e0c5bacd8721f0b5e560e57ea5d85ee8ac6f79ec","plan_hash":"846a2a95286261f1cb1bd339b07d4dacd3c718a7f38e6b2b9346ed30e64ca1e0","plan_text_format":"diff","version":"1.43.0"} -->
Terraform plan for __production__
<details>
<summary>Plan: 12 to add, 5 to change, 2 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.production.cloudfoundry_app.postgrest will be updated in-place
!~  resource "cloudfoundry_app" "postgrest" {
!~      docker_image                    = "ghcr.io/gsa-tts/fac/postgrest@sha256:4b903ac223ea5f583bd870a328a3cf54d19267e5b5abfff896863b37f7cb68b6" -> "ghcr.io/gsa-tts/fac/postgrest@sha256:08852a35ccf68490cf974e2b1a47d19480457c24b2244fa9f302ed785bd89462"
        id                              = "70ac44be-3507-4867-a75f-c2d1ab12ee89"
        name                            = "postgrest"
#        (17 unchanged attributes hidden)

#        (1 unchanged block hidden)
    }

  # module.production.cloudfoundry_network_policy.logshipper-network-policy will be updated in-place
!~  resource "cloudfoundry_network_policy" "logshipper-network-policy" {
        id = "63155665-aac2-9f9d-6c0f-c98cdcec4047"

+       policy {
+           destination_app = "5e81ca8b-99cf-41f8-ae42-76652d51a44c"
+           port            = "61443"
+           protocol        = "tcp"
+           source_app      = (known after apply)
        }
    }

  # module.production.module.cg-logshipper.cloudfoundry_app.cg_logshipper_app will be created
+   resource "cloudfoundry_app" "cg_logshipper_app" {
+       buildpack                       = (known after apply)
+       buildpacks                      = [
+           "https://github.com/cloudfoundry/apt-buildpack",
+           "nginx_buildpack",
        ]
+       disk_quota                      = 256
+       enable_ssh                      = (known after apply)
+       environment                     = (sensitive value)
+       health_check_http_endpoint      = (known after apply)
+       health_check_invocation_timeout = (known after apply)
+       health_check_timeout            = (known after apply)
+       health_check_type               = "process"
+       id                              = (known after apply)
+       id_bg                           = (known after apply)
+       instances                       = 1
+       memory                          = 256
+       name                            = "logshipper"
+       path                            = "../shared/modules/cg-logshipper/logshipper.zip"
+       ports                           = (known after apply)
+       space                           = "5593dba8-7023-49a5-bdbe-e809fe23edf9"
+       stack                           = (known after apply)
+       stopped                         = false
+       strategy                        = "rolling"
+       timeout                         = 180

+       routes {
+           port  = (known after apply)
+           route = (known after apply)
        }

+       service_binding {
+           service_instance = "e0ea8338-12fd-4f46-80a4-881f1964b42e"
        }
+       service_binding {
+           service_instance = "71fc4c29-c97f-4b0d-aad3-a771cbd70b6b"
        }
+       service_binding {
+           service_instance = "2f160a41-a7b7-417e-8856-f665e11b0d03"
        }
    }

  # module.production.module.cg-logshipper.cloudfoundry_route.logshipper will be created
+   resource "cloudfoundry_route" "logshipper" {
+       domain   = "50ba3f69-cd54-4963-9172-14f3334b479e"
+       endpoint = (known after apply)
+       hostname = "fac-production-logshipper"
+       id       = (known after apply)
+       port     = (known after apply)
+       space    = "5593dba8-7023-49a5-bdbe-e809fe23edf9"
    }

  # module.production.module.clamav.cloudfoundry_app.clamav_api will be updated in-place
!~  resource "cloudfoundry_app" "clamav_api" {
!~      docker_image                    = "ghcr.io/gsa-tts/fac/clamav@sha256:b0e61e765f6c9a861cb8a4fbcfbd1df3e45fcbfa7cd78cd67c16d2e540d5301d" -> "ghcr.io/gsa-tts/fac/clamav@sha256:ba95b2eab2464f762071de942b60190be73c901a17a143b234ac3a53dc947d68"
        id                              = "5d0afa4f-527b-472a-8671-79a60335417f"
        name                            = "fac-av-production"
#        (17 unchanged attributes hidden)

#        (1 unchanged block hidden)
    }

  # module.production.module.file_scanner_clamav.data.cloudfoundry_app.app will be read during apply
  # (config refers to values not yet known)
 <= data "cloudfoundry_app" "app" {
+       buildpack                  = (known after apply)
+       command                    = (known after apply)
+       disk_quota                 = (known after apply)
+       enable_ssh                 = (known after apply)
+       environment                = (sensitive value)
+       health_check_http_endpoint = (known after apply)
+       health_check_timeout       = (known after apply)
+       health_check_type          = (known after apply)
+       id                         = (known after apply)
+       instances                  = (known after apply)
+       memory                     = (known after apply)
+       name                       = (known after apply)
+       name_or_id                 = "****************"
+       space                      = (known after apply)
+       stack                      = (known after apply)
+       state                      = (known after apply)
    }

  # module.production.module.file_scanner_clamav.data.cloudfoundry_domain.internal will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "cloudfoundry_domain" "internal" {
+       domain   = (known after apply)
+       id       = (known after apply)
+       internal = (known after apply)
+       name     = "apps.internal"
+       org      = (known after apply)
    }

  # module.production.module.file_scanner_clamav.data.cloudfoundry_space.space will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "cloudfoundry_space" "space" {
+       id       = (known after apply)
+       name     = "production"
+       org      = (known after apply)
+       org_name = "gsa-tts-oros-fac"
+       quota    = (known after apply)
    }

  # module.production.module.file_scanner_clamav.cloudfoundry_app.clamav_api must be replaced
-/+ resource "cloudfoundry_app" "clamav_api" {
+       buildpack                       = (known after apply)
!~      docker_image                    = "ghcr.io/gsa-tts/fac/clamav@sha256:b0e61e765f6c9a861cb8a4fbcfbd1df3e45fcbfa7cd78cd67c16d2e540d5301d" -> "ghcr.io/gsa-tts/fac/clamav@sha256:ba95b2eab2464f762071de942b60190be73c901a17a143b234ac3a53dc947d68"
!~      enable_ssh                      = true -> (known after apply)
+       health_check_http_endpoint      = (known after apply)
!~      health_check_invocation_timeout = 0 -> (known after apply)
!~      health_check_timeout            = 0 -> (known after apply)
!~      id                              = "************************************" -> (known after apply)
!~      id_bg                           = "************************************" -> (known after apply)
-       labels                          = {} -> null
        name                            = "fac-av-production-fs"
!~      ports                           = [] -> (known after apply)
!~      space                           = "5593dba8-7023-49a5-bdbe-e809fe23edf9" # forces replacement -> (known after apply) # forces replacement
+       stack                           = (known after apply)
#        (8 unchanged attributes hidden)

-       routes {
-           port  = 0 -> null
-           route = "e0fd7d4b-55fd-4188-aa9d-1a13b2462355" -> null
        }
+       routes {
+           port  = (known after apply)
+           route = (known after apply)
        }
    }

  # module.production.module.file_scanner_clamav.cloudfoundry_network_policy.clamav_routing will be updated in-place
!~  resource "cloudfoundry_network_policy" "clamav_routing" {
        id = "22404581-6620-4dc7-9fbb-207db75b10be"

-       policy {
-           destination_app = "a14bb29f-8276-4967-9754-cf9c4187ebe3" -> null
-           port            = "61443" -> null
-           protocol        = "tcp" -> null
-           source_app      = "15290fef-8636-4e27-9b57-c86318f85cc8" -> null
        }
+       policy {
+           destination_app = (known after apply)
+           port            = "61443"
+           protocol        = "tcp"
+           source_app      = (known after apply)
        }
    }

  # module.production.module.file_scanner_clamav.cloudfoundry_route.clamav_route must be replaced
-/+ resource "cloudfoundry_route" "clamav_route" {
!~      domain   = "26df58ef-0c0d-4997-b68b-8defb7b3998b" # forces replacement -> (known after apply) # forces replacement
!~      endpoint = "fac-av-production-fs.apps.internal" -> (known after apply)
!~      id       = "************************************" -> (known after apply)
+       port     = (known after apply)
!~      space    = "5593dba8-7023-49a5-bdbe-e809fe23edf9" # forces replacement -> (known after apply) # forces replacement
#        (2 unchanged attributes hidden)
    }

  # module.production.module.https-proxy.cloudfoundry_app.egress_app will be updated in-place
!~  resource "cloudfoundry_app" "egress_app" {
        id                              = "5e81ca8b-99cf-41f8-ae42-76652d51a44c"
        name                            = "https-proxy"
!~      source_code_hash                = "e246274fca627d48afccde010de949371f24b6c9974c48aa91044acd36654fa8" -> "9fcf4a7f6abfc9a220de2b8bb97591ab490a271ac0933b984f606f645319e1a4"
#        (21 unchanged attributes hidden)

#        (1 unchanged block hidden)
    }

  # module.production.module.newrelic.newrelic_alert_policy.alert_policy will be created
+   resource "newrelic_alert_policy" "alert_policy" {
+       account_id          = (known after apply)
+       id                  = (known after apply)
+       incident_preference = "PER_POLICY"
+       name                = "production-alert-policy"
    }

  # module.production.module.newrelic.newrelic_notification_channel.email_channel will be created
+   resource "newrelic_notification_channel" "email_channel" {
+       account_id     = 3919076
+       active         = true
+       destination_id = (known after apply)
+       id             = (known after apply)
+       name           = "production_email_notification_channel"
+       product        = "IINT"
+       status         = (known after apply)
+       type           = "EMAIL"

+       property {
+           key           = "subject"
+           value         = "{{issueTitle}}"
#            (2 unchanged attributes hidden)
        }
    }

  # module.production.module.newrelic.newrelic_notification_destination.email_destination will be created
+   resource "newrelic_notification_destination" "email_destination" {
+       account_id = 3919076
+       active     = true
+       guid       = (known after apply)
+       id         = (known after apply)
+       last_sent  = (known after apply)
+       name       = "email_destination"
+       status     = (known after apply)
+       type       = "EMAIL"

+       property {
+           key           = "email"
+           value         = "daniel.swick@gsa.gov, matthew.jadud@gsa.gov, alexander.steel@gsa.gov"
#            (2 unchanged attributes hidden)
        }
    }

  # module.production.module.newrelic.newrelic_nrql_alert_condition.error_transactions will be created
+   resource "newrelic_nrql_alert_condition" "error_transactions" {
+       account_id                   = 3919076
+       aggregation_delay            = "120"
+       aggregation_method           = "event_flow"
+       aggregation_window           = 60
+       enabled                      = true
+       entity_guid                  = (known after apply)
+       id                           = (known after apply)
+       name                         = "Error Transactions (%)"
+       policy_id                    = (known after apply)
+       type                         = "static"
+       violation_time_limit         = (known after apply)
+       violation_time_limit_seconds = 259200

+       critical {
+           operator              = "above"
+           threshold             = 5
+           threshold_duration    = 300
+           threshold_occurrences = "all"
        }

+       nrql {
+           query = "SELECT percentage(count(*), WHERE error is true) FROM Transaction"
        }

+       warning {
+           operator              = "above"
+           threshold             = 3
+           threshold_duration    = 300
+           threshold_occurrences = "all"
        }
    }

  # module.production.module.newrelic.newrelic_nrql_alert_condition.infected_file_found will be created
+   resource "newrelic_nrql_alert_condition" "infected_file_found" {
+       account_id                   = (known after apply)
+       aggregation_delay            = "120"
+       aggregation_method           = "event_flow"
+       aggregation_window           = 60
+       enabled                      = true
+       entity_guid                  = (known after apply)
+       fill_option                  = "static"
+       fill_value                   = 0
+       id                           = (known after apply)
+       name                         = "Infected File Found!"
+       policy_id                    = (known after apply)
+       type                         = "static"
+       violation_time_limit         = (known after apply)
+       violation_time_limit_seconds = 259200

+       critical {
+           operator              = "above_or_equals"
+           threshold             = 1
+           threshold_duration    = 300
+           threshold_occurrences = "at_least_once"
        }

+       nrql {
+           query = "SELECT count(*) FROM Log WHERE tags.space_name ='production' and message LIKE '%ScanResult.INFECTED%'"
        }
    }

  # module.production.module.newrelic.newrelic_one_dashboard.search_dashboard will be created
+   resource "newrelic_one_dashboard" "search_dashboard" {
+       account_id  = (known after apply)
+       guid        = (known after apply)
+       id          = (known after apply)
+       name        = "Search Dashboard (production)"
+       permalink   = (known after apply)
+       permissions = "public_read_only"

+       page {
+           guid = (known after apply)
+           name = "Search"

+           widget_billboard {
+               column         = 1
+               height         = 3
+               id             = (known after apply)
+               legend_enabled = true
+               row            = 1
+               title          = "Searches Per Hour"
+               width          = 3

+               nrql_query {
+                   account_id = (known after apply)
+                   query      = "SELECT count(*) as 'Total', rate(count(*), 1 minute) as 'Per Minute' FROM Transaction where request.uri like '%/dissemination/search%' and request.method = 'POST' and appName = 'gsa-fac-production' since 1 hours AGO COMPARE WITH 1 week ago"
                }
            }

+           widget_line {
+               column         = 4
+               height         = 3
+               id             = (known after apply)
+               legend_enabled = true
+               row            = 1
+               title          = "Search Traffic"
+               width          = 6

+               nrql_query {
+                   account_id = (known after apply)
+                   query      = "SELECT count(*) FROM Transaction where request.uri like '%/dissemination/search%' and request.method = 'POST' and appName = 'gsa-fac-production' since 4 hours AGO COMPARE WITH 1 week ago TIMESERIES"
                }
            }
+           widget_line {
+               column         = 1
+               height         = 3
+               id             = (known after apply)
+               legend_enabled = true
+               row            = 2
+               title          = "Search Response Time"
+               width          = 6

+               nrql_query {
+                   account_id = (known after apply)
+                   query      = "FROM Metric SELECT average(newrelic.timeslice.value) WHERE appName = 'gsa-fac-production' WITH METRIC_FORMAT 'Custom/search' TIMESERIES SINCE 1 day ago COMPARE WITH 1 week ago"
                }
            }
        }
    }

  # module.production.module.newrelic.newrelic_workflow.alert_workflow will be created
+   resource "newrelic_workflow" "alert_workflow" {
+       account_id            = (known after apply)
+       destinations_enabled  = true
+       enabled               = true
+       enrichments_enabled   = true
+       guid                  = (known after apply)
+       id                    = (known after apply)
+       last_run              = (known after apply)
+       muting_rules_handling = "DONT_NOTIFY_FULLY_MUTED_ISSUES"
+       name                  = "production_alert_workflow"
+       workflow_id           = (known after apply)

+       destination {
+           channel_id            = (known after apply)
+           name                  = (known after apply)
+           notification_triggers = (known after apply)
+           type                  = (known after apply)
        }

+       issues_filter {
+           filter_id = (known after apply)
+           name      = "filter"
+           type      = "FILTER"

+           predicate {
+               attribute = "labels.policyIds"
+               operator  = "EXACTLY_MATCHES"
+               values    = (known after apply)
            }
        }
    }

  # module.production.module.snapshot-database.cloudfoundry_service_instance.rds will be created
+   resource "cloudfoundry_service_instance" "rds" {
+       id                             = (known after apply)
+       json_params                    = jsonencode(
            {
+               storage = 50
            }
        )
+       name                           = "fac-snapshot-db"
+       replace_on_params_change       = false
+       replace_on_service_plan_change = false
+       service_plan                   = "58b899e8-eb36-441f-b406-d2f5b1e49c00"
+       space                          = "5593dba8-7023-49a5-bdbe-e809fe23edf9"
+       tags                           = [
+           "rds",
        ]
    }

Plan: 12 to add, 5 to change, 2 to destroy.

Warning: Argument is deprecated

  with module.domain.cloudfoundry_service_instance.external_domain_instance,
  on /tmp/terraform-data-dir/modules/domain/domain/main.tf line 45, in resource "cloudfoundry_service_instance" "external_domain_instance":
  45:   recursive_delete = var.recursive_delete

Since CF API v3, recursive delete is always done on the cloudcontroller side.
This will be removed in future releases

(and 6 more similar warnings elsewhere)
```
</details>

:memo: Plan generated in [Pull Request Checks #3226](https://github.com/GSA-TTS/FAC/actions/runs/9678074936)